app/views/courses/by_courses.html.erb

		  <td class="uni-name text-left"><%= course.name %></td>
		  <td class="text-center"> <%= University.find(course.universities_id).name 	%></td>
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT 1  [["id", nil]]