app/views/courses/show.html.erb

SELECT "universities".* FROM "universities"  ORDER BY "universities"."name" ASC
---
        <td class="text-center"><%=c.label :university %></td>
        <td class="text-left line-input"><%= c.collection_select :universities_id ,
          University.order(:name), :id, :name ,  {class: "dropdown-menu"} %></td>