app/controllers/courses_controller.rb

	def by_courses
		@courses = Course.order("score DESC")
---
SELECT "courses".* FROM "courses"  ORDER BY score DESC

	def by_students
		@courses = Course.order("students_score DESC")
---
SELECT "courses".* FROM "courses"  ORDER BY students_score DESC

	def update
		@course = Course.find(params[:id])
		if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "courses" SET "universities_id" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["universities_id", 1], ["updated_at", "2018-07-20 03:21:47.658634"], ["id", 4]]

	def create
		@course = Course.new(course_params)
		if @course.save
---
INSERT INTO "courses" ("name", "score", "students_score", "universities_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Arquitetura "], ["score", 71.4], ["students_score", 76.3], ["universities_id", 4], ["created_at", "2018-07-20 03:32:26.235256"], ["updated_at", "2018-07-20 03:32:26.235256"]]