app/controllers/rank_controller.rb

SELECT "universities".* FROM "universities"  ORDER BY final_score DESC
---
	def index
		@universities = University.order("final_score DESC")

SELECT "courses".* FROM "courses"  ORDER BY name ASC
SELECT "universities".* FROM "universities"  ORDER BY name ASC
---
	def new_search
		@courses = Course.order("name ASC")
		@universities = University.order("name ASC")

SELECT courses.*, universities.name as uni_name, universities.final_score FROM "courses" RIGHT JOIN universities on universities.id = courses.universities_id WHERE (universities.id = NULL OR universities.final_score >= '76'
SELECT courses.*, universities.name as uni_name, universities.final_score FROM "universities" LEFT JOIN courses on universities.id = courses.universities_id WHERE (universities.id = NULL OR universities.final_score >= '76'
---
	def search_result

		@results = University
					.select("courses.*, universities.name as uni_name, universities.final_score")
					.joins("LEFT JOIN courses on universities.id = courses.universities_id")
					.where("universities.id = ? OR universities.final_score >= ?
						OR courses.id = ? OR courses.score >= ? OR courses.students_score >= ? ",
						params[:university_id], params[:university_score],
						params[:course_id], params[:course_score],params[:students_score])
					.order("universities.final_score DESC, courses.score DESC, students_score DESC ")