app/controllers/rank_controller.rb

	def index
		@universities = University.all
---
SELECT "universities".* FROM "universities"