app/controllers/universities_controller.rb

	def show
		@university = University.find(params[:id])
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT 1  [["id", 6]]

	def update
		@university = University.find(params[:id])
		if @university.update(uni_params)
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "universities" SET "final_score" = ?, "updated_at" = ? WHERE "universities"."id" = ?  [["final_score", 75.9], ["updated_at", "2018-07-20 00:52:06.301314"], ["id", 9]]

	def create
		@university = University.new(uni_params)
		if @university.save
---
INSERT INTO "universities" ("university_name", "final_score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["university_name", "UFSJ"], ["final_score", 77.7], ["created_at", "2018-07-19 00:59:09.121436"], ["updated_at", "2018-07-19 00:59:09.121436"]]